thorsten-l/ESP8266-WiFi-Socket-II/lib/WebHandler/WebHandler.cpp
#include <AlexaHandler.hpp>
#include <App.hpp>
#include <DefaultAppConfig.h>
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <ESPAsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <RelayHandler.hpp>
#include <WifiHandler.hpp>
#include <LinkedList.hpp>

#include "WebHandler.hpp"
#include "layout-css-gz.h"
#include "pure-min-css-gz.h"
#include "template-html.h"
#include "setup-html.h"

WebHandler webHandler;

static AsyncWebServer server(80);
static bool webPowerState;

String jsonStatus()
{
  String message = "{\"state\":";
  message += (relayHandler.isPowerOn()) ? "1}\r\n" : "0}\r\n";
  return message;
}

String jsonInfo()
{
  char buffer[512];
  sprintf(buffer,
          "{"
          "\"chip_id\":\"%08X\","
          "\"cpu_freq\":\"%dMhz\","
          "\"flash_size\":\"%u\","
          "\"flash_speed\":\"%u\","
          "\"ide_size\":\"%u\","
          "\"fw_name\":\"%s\","
          "\"fw_version\":\"%s\","

#if OBI_VERSION == 1
          "\"obi_version\":\"1\","
#endif

#if OBI_VERSION == 2
          "\"obi_version\":\"2\","
#endif

          "\"free_heap\":\"%u\""
          "}",
          ESP.getChipId(), ESP.getCpuFreqMHz(), ESP.getFlashChipRealSize(),
          ESP.getFlashChipSpeed(), ESP.getFlashChipSize(), 
          APP_NAME, APP_VERSION, ESP.getFreeHeap());
  String message(buffer);
  return message;
}

void handlePageNotFound(AsyncWebServerRequest *request) { request->send(404); }

void prLegend(AsyncResponseStream *response, const char *name)
{
  response->printf("<legend>%s</legend>", name);
}

void prGroupLabel(AsyncResponseStream *response, int id, const char *label)
{
  response->printf("<div class='pure-control-group'>"
                   "<label for='pgid%d'>%s</label>",
                   id, label);
}

void prTextGroup(AsyncResponseStream *response, int id, const char *label,
                 const char *name, const char *value)
{
  prGroupLabel(response, id, label);
  response->printf(
      "<input id='pgid%d' type='text' name='%s' maxlength='64' value='%s'>"
      "</div>",
      id, name, value);
}

void prTextGroup(AsyncResponseStream *response, int id, const char *label,
                 const char *name, int value)
{
  prGroupLabel(response, id, label);
  response->printf(
      "<input id='pgid%d' type='text' name='%s' maxlength='64' value='%d'>"
      "</div>",
      id, name, value);
}

void prCheckBoxGroup(AsyncResponseStream *response, int id, const char *label,
                     const char *name, bool value)
{
  prGroupLabel(response, id, label);
  response->printf(
      "<input id='pgid%d' type='checkbox' name='%s' value='true' %s>"
      "</div>",
      id, name, value ? "checked" : "");
}

void prSelectStart(AsyncResponseStream *response, int id, const char *label,
                   const char *name)
{
  prGroupLabel(response, id, label);
  response->printf("<select id='pgid%d' name='%s'>", id, name);
}

void prSelectEnd(AsyncResponseStream *response)
{
  response->print("</select></div>");
}

void prOption(AsyncResponseStream *response, int value, const char *name,
              bool selected)
{
  response->printf("<option %s value='%d'>%s</option>",
                   selected ? "selected" : "", value, name);
}

void paramChars(AsyncWebServerRequest *request, char *dest,
                const char *paramName, const char *defaultValue)
{
  const char *value = defaultValue;

  if (request->hasParam(paramName, true))
  {
    AsyncWebParameter *p = request->getParam(paramName, true);
    value = p->value().c_str();
    if (value == 0 || strlen(value) == 0)
    {
      value = defaultValue;
    }
  }

  strncpy(dest, value, 63);
  dest[63] = 0;
}

int paramInt(AsyncWebServerRequest *request, const char *paramName,
             int defaultValue)
{
  int value = defaultValue;

  if (request->hasParam(paramName, true))
  {
    AsyncWebParameter *p = request->getParam(paramName, true);
    const char *pv = p->value().c_str();
    if (pv != 0 && strlen(pv) > 0)
    {
      value = atoi(pv);
    }
  }

  return value;
}

bool paramBool(AsyncWebServerRequest *request, const char *paramName)
{
  bool value = false;

  if (request->hasParam(paramName, true))
  {
    AsyncWebParameter *p = request->getParam(paramName, true);
    const char *pv = p->value().c_str();
    if (pv != 0 && strlen(pv) > 0)
    {
      value = strcmp("true", pv) == 0;
    }
  }
  return value;
}

void handleSavePage(AsyncWebServerRequest *request)
{
  if (!request->authenticate("admin", appcfg.admin_password))
  {
    return request->requestAuthentication();
  }

  AsyncResponseStream *response = request->beginResponseStream("text/html");
  response->printf(TEMPLATE_HEADER, APP_NAME " - Save Configuration");
  response->print("<pre>");

  int params = request->params();

  for (int i = 0; i < params; i++)
  {
    AsyncWebParameter *p = request->getParam(i);
    response->printf("%s = '%s'\n", p->name().c_str(), p->value().c_str());
  }

  // Security
  paramChars(request, appcfgWR.admin_password, "admin_password",
             DEFAULT_ADMIN_PASSWORD);

  // WIFI
  appcfgWR.wifi_mode = paramInt(request, "wifi_mode", DEFAULT_WIFI_MODE);
  paramChars(request, appcfgWR.wifi_ssid, "wifi_ssid", DEFAULT_WIFI_SSID);
  paramChars(request, appcfgWR.wifi_password, "wifi_password",
             DEFAULT_WIFI_PASSWORD);

  // Network
  appcfgWR.net_mode = paramInt(request, "net_mode", DEFAULT_NET_MODE);
  paramChars(request, appcfgWR.net_host, "net_host", DEFAULT_NET_HOST);
  paramChars(request, appcfgWR.net_gateway, "net_gateway", DEFAULT_NET_GATEWAY);
  paramChars(request, appcfgWR.net_mask, "net_mask", DEFAULT_NET_MASK);
  paramChars(request, appcfgWR.net_dns, "net_dns", DEFAULT_NET_DNS);

  // OTA
  paramChars(request, appcfgWR.ota_hostname, "ota_hostname",
             DEFAULT_OTA_HOSTNAME);
  paramChars(request, appcfgWR.ota_password, "ota_password",
             DEFAULT_OTA_PASSWORD);

  // OpenHAB
  appcfgWR.ohab_enabled = paramBool(request, "ohab_enabled");
  appcfgWR.ohab_version =
      paramInt(request, "ohab_version", DEFAULT_OHAB_VERSION);
  paramChars(request, appcfgWR.ohab_itemname, "ohab_itemname",
             DEFAULT_OHAB_ITEMNAME);
  paramChars(request, appcfgWR.ohab_host, "ohab_host", DEFAULT_OHAB_HOST);
  appcfgWR.ohab_port = paramInt(request, "ohab_port", DEFAULT_OHAB_PORT);
  appcfgWR.ohab_useauth = paramBool(request, "ohab_useauth");
  paramChars(request, appcfgWR.ohab_user, "ohab_user", DEFAULT_OHAB_USER);
  paramChars(request, appcfgWR.ohab_password, "ohab_password",
             DEFAULT_OHAB_PASSWORD);

  // Alexa
  appcfgWR.alexa_enabled = paramBool(request, "alexa_enabled");
  paramChars(request, appcfgWR.alexa_devicename, "alexa_devicename",
             DEFAULT_ALEXA_DEVICENAME);

  // MQTT
  appcfgWR.mqtt_enabled = paramBool(request, "mqtt_enabled");
  paramChars(request, appcfgWR.mqtt_clientid, "mqtt_clientid",
             DEFAULT_MQTT_CLIENTID);
  paramChars(request, appcfgWR.mqtt_host, "mqtt_host", DEFAULT_MQTT_HOST);
  appcfgWR.mqtt_port = paramInt(request, "mqtt_port", DEFAULT_MQTT_PORT);
  appcfgWR.mqtt_useauth = paramBool(request, "mqtt_useauth");
  paramChars(request, appcfgWR.mqtt_user, "mqtt_user", DEFAULT_MQTT_USER);
  paramChars(request, appcfgWR.mqtt_password, "mqtt_password",
             DEFAULT_MQTT_PASSWORD);
  paramChars(request, appcfgWR.mqtt_intopic, "mqtt_intopic",
             DEFAULT_MQTT_INTOPIC);
  paramChars(request, appcfgWR.mqtt_outtopic, "mqtt_outtopic",
             DEFAULT_MQTT_OUTTOPIC);

  // Syslog
  appcfgWR.syslog_enabled = paramBool(request, "syslog_enabled");
  paramChars(request, appcfgWR.syslog_host, "syslog_host", DEFAULT_SYSLOG_HOST);
  appcfgWR.syslog_port = paramInt(request, "syslog_port", DEFAULT_SYSLOG_PORT);
  paramChars(request, appcfgWR.syslog_app_name, "syslog_app_name",
             DEFAULT_SYSLOG_APP_NAME);

  response->println("</pre>");
  response->println("<h2 style='color: red'>Restarting System</h2>");
  response->print(TEMPLATE_FOOTER);
  request->send(response);
  app.delayedSystemRestart();
}

void handleRootPage(AsyncWebServerRequest *request)
{
  webPowerState = relayHandler.isPowerOn();

  if (request->hasParam("power"))
  {
    AsyncWebParameter *p = request->getParam("power");
    const char *pv = p->value().c_str();
    if (pv != 0 && strlen(pv) > 0)
    {
      if (strcmp("ON", pv) == 0)
      {
        webPowerState = true;
        relayHandler.delayedOn();
      }
      if (strcmp("OFF", pv) == 0)
      {
        webPowerState = false;
        relayHandler.delayedOff();
      }
    }
    request->redirect("/");
    return;
  }

  char titleBuffer[100];
  sprintf(titleBuffer, APP_NAME " - %s", appcfg.ota_hostname);

  AsyncResponseStream *response = request->beginResponseStream("text/html");
  response->printf(TEMPLATE_HEADER, titleBuffer);

  response->print("<form class='pure-form'>");
  prLegend(response, "Current Status");

  response->printf("<div id='idpwr' class='pure-button' "
                   "style='background-color: #%s'>Power is %s</div>",
                   webPowerState ? "80ff80" : "ff8080",
                   webPowerState ? "ON" : "OFF");
  prLegend(response, "Actions");
  response->print(
      "<a href=\"/?power=ON\" class=\"pure-button button-on\">ON</a>"
      "<a href=\"/?power=OFF\" class=\"pure-button button-off\">OFF</a>");

  response->print("</form>");

  response->print(
      "<script>function getPowerState(){var e = "
      "document.getElementById(\"idpwr\");fetch(\"/state\").then((resp) => "
      "resp.json()).then(function(data){if(data.state===1){e.textContent="
      "\"Power is ON\";e.style=\"background-color: #80ff80\";} else "
      "{e.textContent=\"Power is OFF\";e.style=\"background-color: "
      "#ff8080\";}});} setInterval(getPowerState,10000);</script>");

  response->print(TEMPLATE_FOOTER);
  request->send(response);
}

WebHandler::WebHandler() { initialized = false; }



String setupProcessor(const String& var)
{
  String selected = F("selected");
  String checked = F("checked");

  if(var == "admin_password") return String(appcfg.admin_password);


  // Wifi
  if(var == "wifi_mode_ap" && appcfg.wifi_mode == WIFI_AP ) return selected;
  if(var == "wifi_mode_station" && appcfg.wifi_mode == WIFI_STA) return selected;
  
  if( var== "scanned_network_options" )
  {
    ListNode* node = wifiHandler.getScannedNetworks();
    String options = "";

    while( node != NULL )
    {
      options += F("<option>");
      options += String(*node->value);
      options += F("</option>");
      node = node->next;
    }

    return options;
  }
  
  if(var == "wifi_ssid") return String(appcfg.wifi_ssid);
  if(var == "wifi_password") return String(appcfg.wifi_password);

  // Network
  if(var == "net_mode_dhcp" && appcfg.net_mode == NET_MODE_DHCP ) return selected;
  if(var == "net_mode_static" && appcfg.net_mode == NET_MODE_STATIC ) return selected;
  if(var == "net_host") return String(appcfg.net_host);
  if(var == "net_gateway") return String(appcfg.net_gateway);
  if(var == "net_mask") return String(appcfg.net_mask);
  if(var == "net_dns") return String(appcfg.net_dns);

  // OTA
  if(var == "ota_hostname") return String(appcfg.ota_hostname);
  if(var == "ota_password") return String(appcfg.ota_password);

  // OpenHAB
  if(var == "ohab_enabled" && appcfg.ohab_enabled == true ) return checked;
  if(var == "ohab_v1" && appcfg.ohab_version == 1 ) return selected;
  if(var == "ohab_v2" && appcfg.ohab_version == 2 ) return selected;
  if(var == "ohab_itemname") return String(appcfg.ohab_itemname);
  if(var == "ohab_host") return String(appcfg.ohab_host);
  if(var == "ohab_port") return String(appcfg.ohab_port);
  if(var == "ohab_useauth" && appcfg.ohab_useauth == true ) return checked;
  if(var == "ohab_user") return String(appcfg.ohab_user);
  if(var == "ohab_password") return String(appcfg.ohab_password);

  // Alexa
  if(var == "alexa_enabled" && appcfg.alexa_enabled == true ) return checked;
  if(var == "alexa_devicename") return String(appcfg.alexa_devicename);

  // MQTT
  if(var == "mqtt_enabled" && appcfg.mqtt_enabled == true ) return checked;
  if(var == "mqtt_clientid") return String(appcfg.mqtt_clientid);
  if(var == "mqtt_host") return String(appcfg.mqtt_host);
  if(var == "mqtt_port") return String(appcfg.mqtt_port);
  if(var == "mqtt_useauth" && appcfg.mqtt_useauth == true ) return checked;
  if(var == "mqtt_user") return String(appcfg.mqtt_user);
  if(var == "mqtt_password") return String(appcfg.mqtt_password);
  if(var == "mqtt_intopic") return String(appcfg.mqtt_intopic);
  if(var == "mqtt_outtopic") return String(appcfg.mqtt_outtopic);

  // Syslog
  if(var == "syslog_enabled" && appcfg.syslog_enabled == true ) return checked;
  if(var == "syslog_host") return String(appcfg.syslog_host);
  if(var == "syslog_port") return String(appcfg.syslog_port);
  if(var == "syslog_app_name") return String(appcfg.syslog_app_name);
   
  return String();
}

void WebHandler::setup()
{
  LOG0("HTTP server setup...\n");

  server.on("/", HTTP_GET, handleRootPage);
  server.on("/setup.html", HTTP_GET, [](AsyncWebServerRequest *request) {

    if (!request->authenticate("admin", appcfg.admin_password))
    {
      return request->requestAuthentication();
    }

    AsyncWebServerResponse *response = request->beginResponse_P(200, "text/html", SETUP_HTML, setupProcessor );
    response->addHeader("Cache-Control", "no-cache, no-store, must-revalidate");
    response->addHeader("Pragma", "no-cache");
    response->addHeader("Expires", "0");
    request->send(response);
  });

  server.on("/savecfg", HTTP_POST, handleSavePage);

  server.on("/on", HTTP_GET, [](AsyncWebServerRequest *request) {
    relayHandler.delayedOn();
    AsyncWebServerResponse *response =
        request->beginResponse(200, "application/json", "{\"state\":1}\r\n");
    response->addHeader("Access-Control-Allow-Origin", "*");
    request->send(response);
  });

  server.on("/off", HTTP_GET, [](AsyncWebServerRequest *request) {
    relayHandler.delayedOff();
    AsyncWebServerResponse *response =
        request->beginResponse(200, "application/json", "{\"state\":0}\r\n");
    response->addHeader("Access-Control-Allow-Origin", "*");
    request->send(response);
  });

  server.on("/state", HTTP_GET, [](AsyncWebServerRequest *request) {
    AsyncWebServerResponse *response =
        request->beginResponse(200, "application/json", jsonStatus());
    response->addHeader("Access-Control-Allow-Origin", "*");
    request->send(response);
  });

  server.on("/info", HTTP_GET, [](AsyncWebServerRequest *request) {
    AsyncWebServerResponse *response =
        request->beginResponse(200, "application/json", jsonInfo());
    response->addHeader("Access-Control-Allow-Origin", "*");
    request->send(response);
  });

  server.on("/pure-min.css", HTTP_GET, [](AsyncWebServerRequest *request) {
    AsyncWebServerResponse *response = request->beginResponse_P(
        200, "text/css", PURE_MIN_CSS_GZ, PURE_MIN_CSS_GZ_LEN);
    response->addHeader("Content-Encoding", "gzip");
    request->send(response);
  });

  server.on("/layout.css", HTTP_GET, [](AsyncWebServerRequest *request) {
    AsyncWebServerResponse *response = request->beginResponse_P(
        200, "text/css", LAYOUT_CSS_GZ, LAYOUT_CSS_GZ_LEN);
    response->addHeader("Content-Encoding", "gzip");
    request->send(response);
  });

  server.on("/info.html", HTTP_GET, [](AsyncWebServerRequest *request) {
    AsyncResponseStream *response = request->beginResponseStream("text/html");
    response->printf(TEMPLATE_HEADER, APP_NAME " - Info");

    response->print("<form class='pure-form'>");

    prLegend(response, "Application");

    response->print(
        "<p>Name: " APP_NAME "</p>"
        "<p>Version: " APP_VERSION "</p>"

#if OBI_VERSION == 1
        "<p>OBI Socket Version: 1</p>"
#endif

#if OBI_VERSION == 2
        "<p>OBI Socket Version: 2</p>"
#endif

#if DEVELOPMENT_VERSION == 1
        "<p>Development Version: 1</p>"
#endif

        "<p>Author: Dr. Thorsten Ludewig &lt;t.ludewig@gmail.com></p>");

    prLegend(response, "RESTful API");

    char ipAddress[16];
    strncpy(ipAddress, appcfg.net_host, 15 );
    ipAddress[15] = 0;

    response->printf(
        "<p><a href='http://%s/on'>http://%s/on</a> - Socket ON</p>"
        "<p><a href='http://%s/off'>http://%s/off</a> - Socket OFF</p>"
        "<p><a href='http://%s/state'>http://%s/state</a> - Socket JSON status "
        "(0 or 1)</p>"
        "<p><a href='http://%s/info'>http://%s/info</a> - ESP8266 Info</p>",
        ipAddress, ipAddress, ipAddress, ipAddress, ipAddress, ipAddress,
        ipAddress, ipAddress);

    prLegend(response, "Build");
    response->print("<p>Date: " __DATE__ "</p>"
                    "<p>Time: " __TIME__ "</p>");

    prLegend(response, "Services");
    response->printf("<p>OpenHAB Callback Enabled: %s</p>",
                     (appcfg.ohab_enabled) ? "true" : "false");
    response->printf("<p>Alexa Enabled: %s</p>",
                     (appcfg.alexa_enabled) ? "true" : "false");
    response->printf("<p>MQTT Enabled: %s</p>",
                     (appcfg.mqtt_enabled) ? "true" : "false");
    response->printf("<p>Syslog Enabled: %s</p>",
                     (appcfg.syslog_enabled) ? "true" : "false");

    response->print("</form>");
    response->print(TEMPLATE_FOOTER);
    request->send(response);
  });

  if (appcfg.alexa_enabled == true)
  {
    // These two callbacks are required for gen1 and gen3 compatibility
    server.onRequestBody([](AsyncWebServerRequest *request, uint8_t *data,
                            size_t len, size_t index, size_t total) {
      LOG0("server.onRequestBody ");
      if (fauxmo.process(request->client(), request->method() == HTTP_GET,
                         request->url(), String((char *)data)))
        return;
      // Handle any other body request here...
    });
    server.onNotFound([](AsyncWebServerRequest *request) {
      // LOG0("server.onNotFound");
      String body = (request->hasParam("body", true))
                        ? request->getParam("body", true)->value()
                        : String();
      if (fauxmo.process(request->client(), request->method() == HTTP_GET,
                         request->url(), body))
        return;
      handlePageNotFound(request);
    });
  }
  else
  {
    server.onNotFound(handlePageNotFound);
  }

  MDNS.addService("http", "tcp", 80);
  MDNS.addServiceTxt("http", "tcp", "path", "/");
  MDNS.addServiceTxt("http", "tcp", "fw_name", APP_NAME);
  MDNS.addServiceTxt("http", "tcp", "fw_version", APP_VERSION);

  server.begin();

  LOG0("HTTP server started\n");
  initialized = true;
}

void WebHandler::handle()
{
  if (!initialized)
  {
    setup();
  }
}
